SoyVitouPro/ESP32-V2/src/main.cpp
  String contentType = contentTypeFor(path);
  server.streamFile(f, contentType);
  f.close();
}

static uint16_t hexTo565(const String &hex) {
  // Expect formats like "#RRGGBB" or "RRGGBB"
  String s = hex;
  if (s.startsWith("#")) s.remove(0,1);
  if (s.length() != 6) return 0; // default black
  auto h2 = [](char c)->uint8_t{ if(c>='0'&&c<='9')return c-'0'; c|=0x20; if(c>='a'&&c<='f')return c-'a'+10; return 0; };
  uint8_t r = (h2(s[0])<<4) | h2(s[1]);
  uint8_t g = (h2(s[2])<<4) | h2(s[3]);
  uint8_t b = (h2(s[4])<<4) | h2(s[5]);
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

void handleUploadData() {
  HTTPUpload& up = server.upload();
  if (up.status == UPLOAD_FILE_START) {
    Serial.println("/upload: START");
    uploadBuf.clear();
    imgW = imgH = 0;
  } else if (up.status == UPLOAD_FILE_WRITE) {
    uploadBuf.insert(uploadBuf.end(), up.buf, up.buf + up.currentSize);
  } else if (up.status == UPLOAD_FILE_END) {
    Serial.printf("/upload: END bytes=%u\n", (unsigned)uploadBuf.size());
    if (uploadBuf.size() < 4) { server.send(400, "text/plain", "Bad image"); return; }
    imgW = uploadBuf[0] | (uploadBuf[1] << 8);
    imgH = uploadBuf[2] | (uploadBuf[3] << 8);
    if (imgW == 0 || imgH == 0 || imgW > (uint16_t)VIRT_W() || imgH > (uint16_t)VIRT_H()) {
      server.send(400, "text/plain", "Invalid size");
      return;
    }
    size_t expected565 = 4 + (size_t)imgW * (size_t)imgH * 2;
    size_t expectedA8_565 = 4 + (size_t)imgW * (size_t)imgH * 3;
    if (uploadBuf.size() == expectedA8_565) {
      // Parse A8 + RGB565 interleaved
      textPixels.assign((size_t)imgW * (size_t)imgH, 0);
      textAlpha.assign((size_t)imgW * (size_t)imgH, 0);
      const uint8_t* p = &uploadBuf[4];
      for (size_t i = 0; i < (size_t)imgW * (size_t)imgH; ++i) {
        uint8_t a = *p++;
        uint16_t pix = (uint16_t)p[0] | ((uint16_t)p[1] << 8); p += 2;
        textAlpha[i] = a;
        textPixels[i] = pix;
      }
    } else if (uploadBuf.size() == expected565) {
      // Legacy RGB565 only
      const uint16_t* pixels = reinterpret_cast<const uint16_t*>(&uploadBuf[4]);
      textPixels.assign(pixels, pixels + (imgW * imgH));
      textAlpha.clear();
    } else {
      server.send(400, "text/plain", "Size mismatch");
      return;
    }
    Serial.printf("/upload: parsed %ux%u mode=%s\n", imgW, imgH, textAlpha.empty()?"RGB565":"A8+RGB565");
    // No response here; will be sent in the completion handler
  }
}

void handleUploadDone() {
  sendCORSHeaders();
  // Read options - force centering but USE ANIMATION SETTINGS
  bgColor = hexTo565(server.arg("bg"));
  userOffX = 0; // Force center horizontally
  userOffY = 0; // Force center vertically

  // FIX: Read animation parameters from client instead of hardcoding
  animate = (server.arg("animate") == "1");
  animDir = (server.arg("dir") == "right") ? 1 : -1;
  animSpeedMs = server.hasArg("speed") ? constrain(server.arg("speed").toInt(), 2, 60) : 20;
  loopOffsetPx = server.hasArg("interval") ? constrain(server.arg("interval").toInt(), 1, 25) : 5;

  // DEBUG: Print animation settings to Serial
  Serial.printf("Animation settings: animate=%s, dir=%s, speed=%d ms, interval=%d px\n",
                animate ? "true" : "false",
                (animDir == -1) ? "left" : "right",
                animSpeedMs, loopOffsetPx);
  // brightness percent 0..100
  if (server.hasArg("brightness")) {
    int bp = constrain(server.arg("brightness").toInt(), 0, 100);
    uint8_t b8 = (uint8_t)((bp * 255) / 100);
    dma_display->setBrightness8(b8);
  }
  // Clear cached bg image if switching to plain color
  if (server.hasArg("bgMode") && server.arg("bgMode") == "color") {
    hasBgImage = false;
  }

  // If we have a bitmap, either draw once or start animating
  if (!textPixels.empty()) {
    baseY = (int)VIRT_H() / 2 - (int)imgH / 2 + userOffY; // vertical center + offset
    Serial.printf("/upload: drawing at center x~%d y=%d on %dx%d\n", (int)VIRT_W()/2, baseY, (int)VIRT_W(), (int)VIRT_H());
    waitingRestart = false;
    if (animate) {
      // Initialize multi-head array for continuous text stream
      int gap = (int)loopOffsetPx;
      int spacing = (int)imgW + gap; if (spacing < 1) spacing = 1;

      // Calculate how many copies we need to fill the screen + buffer
      const int totalCopies = ((VIRT_W() + spacing * 2) / spacing) + 3;
      heads.clear();
      heads.reserve(totalCopies);

      if (animDir < 0) { // left scrolling - start from right edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(VIRT_W() + (i * spacing));
        }
      } else { // right scrolling - start from left edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(-imgW - (i * spacing));
        }
      }

      Serial.printf("Initialized %d heads for continuous scrolling\n", totalCopies);
      // Compose full frame offscreen then push
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        frameBuffer = bgPixels;
      } else {
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }
      auto blitAt = [&](int xPos){
        int16_t x0 = xPos + userOffX;
        for (int y=0; y<(int)imgH; ++y) {
          int dstY = baseY + y;
          if (dstY < 0 || dstY >= (int)VIRT_H()) continue;
          int srcRow = y * imgW;
          for (int x=0; x<(int)imgW; ++x) {
            int dstX = x0 + x;
            if (dstX < 0 || dstX >= (int)VIRT_W()) continue;
            size_t si = (size_t)srcRow + (size_t)x;
            size_t di = (size_t)dstY * (size_t)VIRT_W() + (size_t)dstX;
            if (di >= frameBuffer.size()) continue;
            if (!g_panel_active.empty()) {
              int pidx = panelIndexFromXY(dstX, dstY);
              if (pidx >= 0 && pidx < (int)g_panel_active.size() && g_panel_active[pidx] == 0) continue;
            }
            if (!textAlpha.empty()) {
              if (textAlpha[si]) frameBuffer[di] = textPixels[si];
            } else {
              frameBuffer[di] = textPixels[si];
            }
          }
        }
      };
      // Draw all heads for continuous text stream
      for (int i = 0; i < (int)heads.size(); i++) {
        blitAt(heads[i]);
      }
      maskDisabledPanels();
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());
      // ensure animation starts moving immediately on next loop
      lastAnim = millis() - animSpeedMs;
    } else {
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        frameBuffer = bgPixels;
      } else {
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }
      int16_t x = (int)VIRT_W() / 2 - (int)imgW / 2 + userOffX; // horizontal center + offset
      for (int y=0; y<(int)imgH; ++y) {
        int dstY = baseY + y;
        if (dstY < 0 || dstY >= (int)VIRT_H()) continue;
        int srcRow = y * imgW;
        for (int x2=0; x2<(int)imgW; ++x2) {
          int dstX = x + x2;
          if (dstX < 0 || dstX >= (int)VIRT_W()) continue;
          size_t si = (size_t)srcRow + (size_t)x2;
          size_t di = (size_t)dstY * (size_t)VIRT_W() + (size_t)dstX;
          if (di >= frameBuffer.size()) continue;
          if (!g_panel_active.empty()) {
            int pidx = panelIndexFromXY(dstX, dstY);
            if (pidx >= 0 && pidx < (int)g_panel_active.size() && g_panel_active[pidx] == 0) continue;
          }
          if (!textAlpha.empty()) {
            if (textAlpha[si]) frameBuffer[di] = textPixels[si];
          } else {
            frameBuffer[di] = textPixels[si];
          }
        }
      }
      maskDisabledPanels();
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());
    }
  }
  server.send(200, "text/plain", "OK");
}

// Handle background image upload at /upload_bg
// Expects RGB565 little-endian with 4-byte header [wL,wH,hL,hH]
void handleUploadBgData() {
  HTTPUpload& up = server.upload();
  static std::vector<uint8_t> buf;
  static uint16_t bw = 0, bh = 0;
  if (up.status == UPLOAD_FILE_START) {
    buf.clear(); bw = bh = 0;
  } else if (up.status == UPLOAD_FILE_WRITE) {
    buf.insert(buf.end(), up.buf, up.buf + up.currentSize);
  } else if (up.status == UPLOAD_FILE_END) {
    if (buf.size() < 4) { server.send(400, "text/plain", "Bad image"); return; }
    bw = buf[0] | (buf[1] << 8);
    bh = buf[2] | (buf[3] << 8);
    size_t expected = 4 + (size_t)bw * (size_t)bh * 2;
    if (buf.size() != expected) { server.send(400, "text/plain", "Size mismatch"); return; }
    // Resize bgPixels to panel size and blit (centered if different size)
    bgPixels.assign((size_t)VIRT_W() * (size_t)VIRT_H(), bgColor);
    const uint16_t* src = reinterpret_cast<const uint16_t*>(&buf[4]);
    int offx = ((int)VIRT_W() - (int)bw) / 2;
    int offy = ((int)VIRT_H() - (int)bh) / 2;
    for (int y=0; y<(int)bh; ++y) {
      int dy = offy + y; if (dy < 0 || dy >= (int)VIRT_H()) continue;
      for (int x=0; x<(int)bw; ++x) {
        int dx = offx + x; if (dx < 0 || dx >= (int)VIRT_W()) continue;
        bgPixels[(size_t)dy * VIRT_W() + (size_t)dx] = src[(size_t)y * bw + (size_t)x];
      }
    }
    hasBgImage = true;
    // Show background immediately if no text
    if (textPixels.empty()) {
      if (bgPixels.size() == (size_t)VIRT_W() * (size_t)VIRT_H()) {
        vdisplay->drawRGBBitmap(0, 0, bgPixels.data(), VIRT_W(), VIRT_H());
      } else {
        vdisplay->fillScreen(bgColor);
      }
    }
  }
}

void handleUploadBgDone() {
  sendCORSHeaders();
  // No additional args needed; just acknowledge
  server.send(200, "text/plain", "OK");
}

// Handle theme file upload at /upload_theme
void handleUploadTheme() {
  HTTPUpload& up = server.upload();
  static File themeFile;

  if (up.status == UPLOAD_FILE_START) {
    Serial.println("/upload_theme: START");
    // Open file for writing
    themeFile = LittleFS.open("/theme.html", "w");
    if (!themeFile) {
      Serial.println("/upload_theme: Failed to open file for writing");
    }
  } else if (up.status == UPLOAD_FILE_WRITE) {
    if (themeFile) {
      themeFile.write(up.buf, up.currentSize);
    }
  } else if (up.status == UPLOAD_FILE_END) {
    Serial.printf("/upload_theme: END bytes=%u\n", (unsigned)up.totalSize);
    if (themeFile) {
      themeFile.close();
      Serial.println("/upload_theme: Theme saved to /theme.html");
      sendCORSHeaders();
      server.send(200, "text/plain", "Theme uploaded successfully");
    } else {
      Serial.println("/upload_theme: Failed to save theme (file not open)");
      sendCORSHeaders();
      server.send(500, "text/plain", "Failed to save theme");
    }
  }
}

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println("Starting HUB75 + WebServer for Khmer text...");

  randomSeed(micros());

  // Module configuration
  HUB75_I2S_CFG mxconfig(
    PANEL_RES_X,
    PANEL_RES_Y,
    PANEL_CHAIN
  );

  // Pin mapping
  mxconfig.gpio.r1 = R1_PIN;
  mxconfig.gpio.g1 = G1_PIN;
  mxconfig.gpio.b1 = B1_PIN;
  mxconfig.gpio.r2 = R2_PIN;
  mxconfig.gpio.g2 = G2_PIN;
  mxconfig.gpio.b2 = B2_PIN;
  mxconfig.gpio.a = A_PIN;
  mxconfig.gpio.b = B_PIN;
  mxconfig.gpio.c = C_PIN;
  mxconfig.gpio.d = D_PIN;
  mxconfig.gpio.e = E_PIN;
  mxconfig.gpio.lat = LAT_PIN;
  mxconfig.gpio.oe = OE_PIN;
  mxconfig.gpio.clk = CLK_PIN;

  // Panel driver/timing options
  mxconfig.clkphase = false;
  mxconfig.driver = HUB75_I2S_CFG::FM6124;

  // Display Setup
  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  if (!dma_display->begin()) {
    Serial.println("MatrixPanel_I2S_DMA begin() failed!");
    while (true) { delay(1000); }
  }
  dma_display->setBrightness8(200);
  dma_display->clearScreen();
  // Virtual matrix wrapper for chaining/mapping (uses enum PANEL_CHAIN_TYPE)
  vdisplay = new VirtualMatrixPanel(*dma_display, cur_rows, cur_cols, PANEL_RES_X, PANEL_RES_Y, VIRTUAL_MATRIX_CHAIN_TYPE);
  // Clear screen
  vdisplay->fillScreen(dma_display->color565(0, 0, 0));
  frameBuffer.assign((size_t)VIRT_W() * (size_t)VIRT_H(), 0);

