SoyVitouPro/ESP32-V2/src/main.cpp
  // Initialize panel-active mask to hardware (all ON by default)
  g_panel_active.assign((size_t)cur_rows * (size_t)cur_cols, 1);

  // Draw seam guides for current layout
  if (cur_cols > 1) {
    for (int y = 0; y < VIRT_H(); ++y) vdisplay->drawPixel(PANEL_RES_X, y, vdisplay->color565(0, 64, 255));
  }
  if (cur_rows > 1) {
    for (int x = 0; x < VIRT_W(); ++x) vdisplay->drawPixel(x, PANEL_RES_Y, vdisplay->color565(0, 64, 255));
  }

  // Mount LittleFS to serve index.html
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS mount failed");
  } else {
    Serial.println("LittleFS mounted");
  }

  // Bring up Wi-Fi AP and web server
  WiFi.mode(WIFI_AP);
  if (!WiFi.softAP(AP_SSID, AP_PASS)) {
    Serial.println("SoftAP failed");
  } else {
    Serial.print("AP SSID: "); Serial.println(AP_SSID);
    Serial.print("AP IP: "); Serial.println(WiFi.softAPIP());
  }
  server.on("/", HTTP_GET, handleRoot);
  server.onNotFound(handleStaticFile);
  server.on("/upload", HTTP_POST, handleUploadDone, handleUploadData);
  server.on("/upload_bg", HTTP_POST, handleUploadBgDone, handleUploadBgData);
  server.on("/upload_theme", HTTP_POST, [](){ server.send(200, "text/plain", "Theme upload complete"); }, handleUploadTheme);

  // CORS preflight handler
  server.on("/upload", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/upload_bg", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/upload_theme", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/theme_status", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/panel_info", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/panel_layout", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  // Panel layout configuration: configure panel arrangement
  // usage: POST /panel_layout layout=1x1
  server.on("/panel_layout", HTTP_POST, [](){
    if (!server.hasArg("layout")) { server.send(400, "text/plain", "Missing layout"); return; }
    String l = server.arg("layout"); l.toLowerCase();
    int new_rows = cur_rows, new_cols = cur_cols;
    if (l == "1x1") { new_rows = 1; new_cols = 1; }
    else { server.send(400, "text/plain", "Invalid layout"); return; }

    sendCORSHeaders();
    if (new_rows == cur_rows && new_cols == cur_cols) { server.send(200, "text/plain", "OK"); return; }

    // Recreate virtual panel with new layout
    cur_rows = new_rows; cur_cols = new_cols;
    if (vdisplay) { delete vdisplay; vdisplay = nullptr; }
    vdisplay = new VirtualMatrixPanel(*dma_display, cur_rows, cur_cols, PANEL_RES_X, PANEL_RES_Y, VIRTUAL_MATRIX_CHAIN_TYPE);
    vdisplay->fillScreen(0);

    // Resize buffers and clear
    frameBuffer.assign((size_t)VIRT_W() * (size_t)VIRT_H(), 0);
    if (hasBgImage) {
      // Invalidate bg if size mismatch; user can re-upload
      if (bgPixels.size() != frameBuffer.size()) { hasBgImage = false; bgPixels.clear(); }
    }

    // Redraw seam guides
    if (cur_cols > 1) { for (int y = 0; y < VIRT_H(); ++y) vdisplay->drawPixel(PANEL_RES_X, y, vdisplay->color565(0,64,255)); }
    if (cur_rows > 1) { for (int x = 0; x < VIRT_W(); ++x) vdisplay->drawPixel(x, PANEL_RES_Y, vdisplay->color565(0,64,255)); }

    // Adjust active mask to hardware count (1 panel)
    g_panel_active.assign((size_t)cur_rows * (size_t)cur_cols, 1);
    sendCORSHeaders();
    server.send(200, "text/plain", "OK");
  });
  // Panel info endpoint (detected/configured count)
  server.on("/panel_info", HTTP_GET, [](){
    // Report current layout and hardware detected panel count
    String json = "{";
    json += "\"rows\":" + String(cur_rows) + ",";
    json += "\"cols\":" + String(cur_cols) + ",";
    int detected = 1;
    json += "\"detected\":" + String(detected) + ",";
    // labels
    json += "\"labels\":[";
    for (int i = 0; i < detected; ++i) {
      if (i) json += ",";
      json += "\""; json += panelLabelForIndex(i); json += "\"";
    }
    json += "],";
    // active
    json += "\"active\":[";
    for (int i = 0; i < detected; ++i) {
      if (i) json += ",";
      int v = (i < (int)g_panel_active.size()) ? g_panel_active[i] : 0;
      json += String(v);
    }
    json += "]}";
    sendCORSHeaders();
    server.send(200, "application/json", json);
  });
  // Theme status endpoint
  server.on("/theme_status", HTTP_GET, [](){
    sendCORSHeaders();
    File f = LittleFS.open("/theme.html", "r");
    String status = f ? "{\"theme_uploaded\":true}" : "{\"theme_uploaded\":false}";
    if (f) f.close();
    server.send(200, "application/json", status);
  });
  server.begin();
}

void loop() {
  server.handleClient();
  // Animate if enabled and we have a text bitmap
  if (animate && !textPixels.empty()) {
    uint32_t now = millis();
    if (now - lastAnim >= animSpeedMs) {
      // DEBUG: Animation loop is running
      Serial.printf("Animation loop running - managing %d heads\n", (int)heads.size());
      lastAnim = now;
      // compose background
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        frameBuffer = bgPixels;
      } else {
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }
      // blit two heads
      auto blitAt = [&](int xPos){
        int16_t x0 = xPos + userOffX;
        for (int y=0; y<(int)imgH; ++y) {
          int dstY = baseY + y;
          if (dstY < 0 || dstY >= (int)VIRT_H()) continue;
          int srcRow = y * imgW;
          for (int x2=0; x2<(int)imgW; ++x2) {
            int dstX = x0 + x2;
            if (dstX < 0 || dstX >= (int)VIRT_W()) continue;
            size_t si = (size_t)srcRow + (size_t)x2;
            if (!textAlpha.empty()) {
              if (textAlpha[si]) frameBuffer[(size_t)dstY * VIRT_W() + (size_t)dstX] = textPixels[si];
            } else {
              frameBuffer[(size_t)dstY * VIRT_W() + (size_t)dstX] = textPixels[si];
            }
          }
        }
      };
      // Draw all heads for continuous text stream
      for (int i = 0; i < (int)heads.size(); i++) {
        blitAt(heads[i]);
      }
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());

      // advance all heads
      int gap = (int)loopOffsetPx;
      int spacing = (int)imgW + gap; if (spacing < 1) spacing = 1;

      if (animDir < 0) { // left scrolling
        // Move all heads left
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] -= 1;
        }

        // Recycle any head that goes completely off screen
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] + imgW <= 0) {
            // Find the rightmost head to position after it
            int rightmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] > rightmost) rightmost = heads[j];
            }
            heads[i] = rightmost + spacing;
          }
        }
      } else { // right scrolling
        // Move all heads right
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] += 1;
        }

        // Recycle any head that goes completely off screen
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] >= VIRT_W()) {
            // Find the leftmost head to position before it
            int leftmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] < leftmost) leftmost = heads[j];
            }
            heads[i] = leftmost - spacing;
          }
        }
      }
    }
  } else {
    delay(2); // yield CPU when idle
  }
}